#include	"assert.h"

 /*=============================================================================*/
int	(*G_assert_p_puts)(const char*);
 /*=============================================================================*/


 /*=============================================================================*/
void itoa(int value, char *buff);
char *strrev(char *s);
 /*=============================================================================*/



void	doAssert( unsigned int val, unsigned int line_num, const char* file_name )
{
	char	line_num_str[10];

	itoa( line_num, line_num_str );

	if( val == 1 ){
		(*G_assert_p_puts)("GRN: ");
	}else{
		(*G_assert_p_puts)("RED: ");
	}

	(*G_assert_p_puts)(file_name );
	(*G_assert_p_puts)(", L:" );
	(*G_assert_p_puts)(line_num_str);
	(*G_assert_p_puts)("\n");
}


 /*=============================================================================*/
/*http://oshiete.goo.ne.jp/qa/3355671.html*/
/* =============================================================================

 * itoa
 * 整数を文字に変換する。
 *
 * 引数
 * (in) value変換元の整数
 * (out) buff変換後の数値文字列を格納する文字配列のアドレス
 * 戻り値
 * なし
 * 備考
 * atoi はＣの stdlib.h に含まれているが、itoa は標準では存在しないので
 * あえて自作した。
 *
 * ===============================================================================
 * */
void itoa(int value, char *buff)
{
	char *p;
	int mod;

	// 入力した値の正負を文字にする。
	if( 0 > value ) {
		*buff++ = '-';
		 value = -value;
	 }
	 p = buff;
	
	 // 入力した値を下位の桁から順に文字にする。
	 do{
		 mod = value % 10 + 48;
		 *p++ = (char)mod;
		 value /= 10;
	 }while(value);
	
	 *p = '\0';// 文字列の最後に '\0' を追加して締める。
	
	 strrev(buff);// 文字列の上位の桁から始まるように並べ替える。
 }
	
 /* =============================================================================
 strrev
 文字列を最後から先頭に並べ変える

 引数
 (in) s変換元の整数
 戻り値
 並べ替えた文字列
 備考
 文字列の最後に '\0' が含まれていること。
 ===============================================================================
 */
 char *strrev(char *s)
 {
	 char *ret = s;
	 char *t = s;
	 char c;
	
	 while( *t != '\0' )
	 t++;
	 t--;
	
	 while(t > s) {
		 c = *s;
		 *s = *t;
		 *t = c;
		 s++;
		 t--;
	 }
	
	 return ret;
 }
